### Terraform Plan Result - Plan Failed

### OK Estimated Monthly Cost: $0.00

#### By Category
| Category | Monthly Cost (USD) |
| --- | --- |
| kms | $0.00 |


#### By Service
| Service | Monthly Cost (USD) |
| --- | --- |
| (none) | $0.00 |


#### Top Resources (Monthly)
| Resource | Monthly Cost (USD) |
| --- | --- |
| (none) | $0.00 |


<details>
<summary>Infracost Raw Table (click to expand)</summary>

```
Project: jiwonseok97/prowler_GitHub-Actions/tmp/tmp.r24N5AqVzm/plan.json
Module path: /tmp/tmp.r24N5AqVzm/plan.json

Errors:
  Error sending API request:
    Post "https://pricing.api.infracost.io/graphql":
      POST https://pricing.api.infracost.io/graphql giving up after 5 attempt(s)

 OVERALL TOTAL       $0.00 

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

──────────────────────────────────
No cloud resources were detected

┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━┓
┃ Project                                                         ┃ Baseline cost ┃ Usage cost* ┃ Total cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━┫
┃ jiwonseok97/prowler_GitHub-Actions/tmp/tmp.r24N5AqVzm/plan.json ┃         $0.00 ┃           - ┃      $0.00 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━┛
```

</details>

<details>
<summary>Plan details (click to expand)</summary>

```
## Category: iam
SKIP iam: no files found
## Category: kms
  Files: 1

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.32.0...
- Installed hashicorp/aws v6.32.0 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
WARN kms: tfsec found issues (non-blocking)
[32m[1mSuccess![0m The configuration is valid.
[0m
Acquiring state lock. This may take a few moments...
data.aws_caller_identity.current: Reading...
data.aws_partition.current: Reading...
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Read complete after 1s [id=132410971304]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_kms_key.remediation_existing_key will be created
  + resource "aws_kms_key" "remediation_existing_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = (known after apply)
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = true
      + policy                             = (known after apply)
      + region                             = "ap-northeast-2"
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = (known after apply)
    }

  # aws_kms_key.remediation_multi_region_key will be created
  + resource "aws_kms_key" "remediation_multi_region_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "Remediation multi-region KMS key"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = true
      + policy                             = (known after apply)
      + region                             = "ap-northeast-2"
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"
2026-02-13T07:21:12Z INFO Autodetected 1 Terraform plan JSON file project across 1 root module
2026-02-13T07:21:12Z INFO Found Terraform plan JSON file project "-tmp-tmp.r24N5AqVzm-plan.json" at directory "/tmp/tmp.r24N5AqVzm/plan.json"

2026-02-13T07:21:28Z INFO Output saved to /tmp/infracost-kms.json

```

</details>

> Merging this PR will auto-apply these resources to AWS.